'''
#导入所需库
import zipfile #解压文件库
#先将要处理的word文档用zipfile进行压缩
word = zipfile.ZipFile('demo.docx')

#找到要处理的xml文件并以utf-8的格式读取
xml = word.read('word/document.xml').decode('utf-8')
xml_list = xml.split('<w:t>')
text_list = []
for i in xml_list:
    if i.find('</w:t>') + 1:
        text_list.append(i[:i.find('</w:t>')])
        print(i[:i.find('</w:t>')])
    else:
        pass

text = ''.join(text_list) #以空字符串为间隔，将列表拆分为字符串
print(text)
'''
import json
string = {
    "基本信息":{
        "姓名":"张三", 
        "民族":"汉族", 
        "电话":"111-2222-3333", 
        "邮箱":"1876245396@qq.com", 
        "绩点":"3.7/5.0", 
        "出生年月":"2006.10", 
        "在读学校":"上海xxx大学", 
        "学历":"本科在读", 
        "年级":"2018级"
    }, 
    "教育背景":{
        "在读学校":"上海xxx大学", 
        "专业":"软件工程", 
        "主修课程":["程序设计基础", "算法设计与分析", "数据结构与算法", "面向对象分析与设计", "计算机网络", "操作系统", "计算机组成原理", "移动终端软件开发"]
    }, 
    "证书":["大学英语四级50分", "大学英语六级520分", "上海市计算机二级考试等级优秀"], 
    "技能":[
        "熟悉java基础语法，多线程编程，了解java反射机制", 
        "熟悉Mysql数据库常用语法，有数据库相关业务代码的开发经验，了解非关系型数据库基础语法",
        "熟悉Spring框架 熟悉数据结构，包括表，栈与队列，树，图，查找，排序等常用数据结构",
        "熟悉算法设计，了解分治法，动态规划，贪心算法，回溯法等常见算法",
        "熟悉操作系统与计算机网络相关知识，如TCP/UDP协议，CPU调度算法等基础知识",
        "熟悉Android基础开发",
        "熟悉使用Git对项目的版本管理，熟悉常用git指令"
    ],
    "工作经历":{
        "时间":"2020.12-至今",
        "公司":"xxx（上海）有限公司",
        "职位":"前端开发实习生",
        "工作内容":["维护已有线上项目，根据客户需求修改网页","参与公司产品的前端开发工作（包括PC、以及移动端开发），页面搭建"]
    },
    "学习能力":[
        "2018-2019年度校优秀生奖学金三等奖",
        "2019-2020年度校优秀生奖学金二等奖",
        "2020-2021年度校优秀生奖学金一等奖",
        "单项奖学金：第十六届程序设计大赛暨蓝桥杯校内选拔赛一等奖",
        "2019-2020学年“优秀学生”",
        "2020-2021学年“优秀团员”"
    ]
}
js = json.dumps(string, indent=4, separators=(',', ':'), ensure_ascii=False)
with open("demo.json", "w") as f:
    f.write(js)